# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the `your-code` folder of this lab.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary.

In [2]:
# your answer here

In [1]:
import pandas as pd
import numpy as np

#### Open the ` Employee.csv` file and name your dataset `employee`.

In [2]:
# your answer here

In [3]:
employee = pd.read_csv("Employee.csv")
employee.head()

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55

#### What's the mean salary by department?
Hint : There are 2 ways to do it - one way is with groupby and the other way is with pivot tables. Do it both ways.

In [ ]:
# Method 1
# your answer here

In [4]:
employee.groupby(['Department']).agg({'Salary':'mean'})

            Salary
Department
HR           45.00
IT           48.75
Sales        55.00

#### We want now to group the data by more than one column. Use Pandas pivot table function to select the mean salary by department and title.

In [ ]:
# Method 2
# your answer here

In [ ]:
# your answer here

In [6]:
employee.pivot_table(index= ['Department','Salary'])

                   Years
Department Salary
HR         30        2.0
           35        4.0
           70        8.0
IT         30        2.0
           35        1.0
           60        7.0
           70        8.0
Sales      55        2.5

#### We want to display the number of years of work experience and the salary for each Title. Add Years as a column in your pivot table.
*Hint: Use Pandas doc(see References in README.md) to explore the pivot_table() arguments*

In [ ]:
# your answer here

In [11]:
employee.pivot_table(index= ['Title'], values = ['Years','Salary'])

              Salary  Years
Title
VP         70.000000   8.00
analyst    32.500000   2.25
associate  56.666667   4.00

#### We want to know the information about the mean salary and number of employees in each department and for each job title.

In [ ]:
# your answer here

In [13]:
employee.pivot_table(index= ['Title', 'Department'], values = ['Salary','Name'],aggfunc = {'Salary':'mean','Name':'count'})

                      Name  Salary
Title     Department
VP        HR             1    70.0
          IT             1    70.0
analyst   HR             2    32.5
          IT             2    32.5
associate IT             1    60.0
          Sales          2    55.0

#### We want to know for each department and for each job title the Salary's median, minimum, maximum and standard deviation. Comment your results.

In [ ]:
# your answer here

In [19]:
#Salary's median
employee.pivot_table(index= ['Title', 'Department'], values = ['Salary'],aggfunc = {'Salary':'median'})

                      Salary
Title     Department
VP        HR            70.0
          IT            70.0
analyst   HR            32.5
          IT            32.5
associate IT            60.0
          Sales         55.0

In [20]:
#Salary's min
employee.pivot_table(index= ['Title', 'Department'], values = ['Salary'],aggfunc = {'Salary':'min'})

                      Salary
Title     Department
VP        HR              70
          IT              70
analyst   HR              30
          IT              30
associate IT              60
          Sales           55

In [21]:
#Salary's max
employee.pivot_table(index= ['Title', 'Department'], values = ['Salary'],aggfunc = {'Salary':'max'})

                      Salary
Title     Department
VP        HR              70
          IT              70
analyst   HR              35
          IT              35
associate IT              60
          Sales           55

In [22]:
#Salary's std
employee.pivot_table(index= ['Title', 'Department'], values = ['Salary'],aggfunc = {'Salary':'std'})

                        Salary
Title     Department
analyst   HR          3.535534
          IT          3.535534
associate Sales       0.000000

#### Based on your comments, fill the missing values with an appropriate value.

In [27]:
# your answer here

I do not undestand ! I do not see any missing value in this table

#### The stake holders want to know for each department the number of employees and how much money is spend on salaries. Could you provide that information?

In [ ]:
# your answer here

In [24]:
employee

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

In [29]:
employee.pivot_table(index=['Department'], values = ['Salary', 'Name'] ,aggfunc = {'Salary':'sum', 'Name':'count'})

            Name  Salary
Department
HR             3     135
IT             4     195
Sales          2     110

#### For each Department and Title, we want to know the the total years of work experience and the mean salary.

In [ ]:
# your answer here

In [31]:
employee.pivot_table(index=['Department', 'Title'], values = ['Years', 'Salary'] ,aggfunc = {'Years':'sum', 'Salary':'mean'})

                      Salary  Years
Department Title
HR         VP           70.0      8
           analyst      32.5      6
IT         VP           70.0      8
           analyst      32.5      3
           associate    60.0      7
Sales      associate    55.0      5

### Bonus

#### We now want to compute the mean salary after removing the maxima for each Department. Create the appropriate pivot table.

Hint: Write a custom function.

In [ ]:
# your answer here